cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
brew 'mas'

brew 'bash-completion'
brew 'gnutls'

brew 'git'
brew 'gh'

brew 'bat'
brew 'fd'
brew 'graphviz'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'jsonpp'
brew 'rename'
brew 'rg'
brew 'rlwrap'
brew 'shellcheck'
brew 'tree'
brew 'wget'

cask '1password-cli'
cask '1password'
cask 'discord'
cask 'dropbox'
cask 'github'
cask 'netnewswire'
cask 'obsidian'
cask 'visual-studio-code'

mas '1Password for Safari', id: 1569813296
mas 'iA Writer', id: 775737590
mas 'Muse', id: 1501563902
mas 'Pixelmator Pro', id: 1289583905
mas 'Slack', id: 803453959
mas 'Soulver 3', id: 1508732804
mas 'Things', id: 904280696
mas 'Xcode', id: 497799835

cask 'font-ia-writer-mono'
cask 'font-ia-writer-duo'
cask 'font-ia-writer-quattro'
cask 'font-ia-writer-duospace'
cask 'font-inter'
cask 'font-ibm-plex'
cask 'font-figtree'
