cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
brew 'mas'

brew 'bash-completion'
brew 'gnutls'

tap 'railwaycat/emacsmacport'
brew 'aspell'
brew 'emacs-mac'
cask 'karabiner-elements'
brew 'stow'

brew 'git'
cask 'gpg-suite'

brew 'bat'
brew 'fd'
brew 'graphviz'
brew 'htop'
brew 'imagemagick', args: ['with-webp']
brew 'rename'
brew 'rg'
brew 'rlwrap'
brew 'tree'
brew 'wget'
brew 'jsonpp'
brew 'jq'

brew 'bazel'

brew 'nvm'
brew 'yarn', args: ['without-node']

brew 'ocaml'
brew 'opam'

brew 'go'

brew 'nim'

brew 'rbenv'
brew 'ruby-build'

brew 'python'

brew 'php'
brew 'watchman'

brew 'clojure'
brew 'leiningen'

brew 'postgres'
brew 'mysql'
brew 'sqlite'
brew 'postgresql'

brew 'ledger'
brew 'hledger'

cask '1password'
cask 'spotify'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'firefox'
cask 'sketch'
cask 'now'
cask 'visual-studio-code'

mas 'Things3', id: 904280696
mas 'iA Writer', id: 775737590
mas 'Pixelmator Pro', id: 1289583905

cask 'font-ia-writer-duospace'
cask 'font-inter'
