cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
brew 'mas'

brew 'stow'
brew 'bash-completion'
brew 'gnutls'

brew 'git'
cask 'gpg-suite'

brew 'bat'
brew 'fd'
brew 'graphviz'
brew 'htop'
brew 'imagemagick', args: ['with-webp']
brew 'rename'
brew 'rg'
brew 'rlwrap'
brew 'tree'
brew 'wget'
brew 'jsonpp'
brew 'jq'

brew 'nvm'
brew 'yarn'

brew 'sqlite'

brew 'hledger'

brew 'ccmenu'

cask '1password'
cask 'spotify'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'firefox'
cask 'sketch'
cask 'visual-studio-code'

mas 'Things3', id: 904280696
mas 'iA Writer', id: 775737590
mas 'Pixelmator Pro', id: 1289583905

cask 'font-ia-writer-duospace'
cask 'font-inter'
